# Groupby

### **GroupBy in Pandas**

**`GroupBy`** in Pandas is a process of splitting a DataFrame or Series into groups based on some criteria, applying a function to each group independently, and then combining the results into a single output. This operation enables us to perform efficient computations on subsets of the data. It's a powerful tool for summarizing data.

#### Key steps in the `GroupBy` process:
1. **Splitting**: The data is split into groups based on some criteria, such as a column value.
2. **Applying**: A function is applied to each group, such as aggregation, transformation, or filtering.
3. **Combining**: The results are combined back into a DataFrame or Series.
 
#### Basic syntax:

```python
grouped_data = df.groupby('column_name')
```



### **Aggregation in Pandas**

**`Aggregation`** refers to applying one or more summary statistics (like sum, mean, count, etc.) to the grouped data. Aggregation functions reduce data from multiple rows into a single value.

Pandas provides a variety of aggregation functions, including:

- **`.mean()`**: Returns the mean (average) of the values.
- **`.sum()`**: Returns the sum of the values.
- **`.count()`**: Returns the number of non-null values.
- **`.min()`**: Returns the minimum value.
- **`.max()`**: Returns the maximum value.
- **`.std()`**: Returns the standard deviation.
- **`.var()`**: Returns the variance.

#### Aggregation Syntax:

```python
grouped_data.agg({'column_name': 'function'})
```

You can apply a single function or multiple functions using `.agg()`.

### Example of Aggregation:

```python
# Group by 'Department' and calculate the mean salary
mean_salary = df.groupby('Occupation')['Salary'].mean()
print(mean_salary)
```

**Output**:
```
Department
Finance    62333.333333
HR         51000.000000
Name: Salary, dtype: float64
```

### Aggregation with multiple functions:

```python
# Aggregating multiple statistics
agg_result = df.groupby('Department')['Salary'].agg(['mean', 'sum', 'max'])
print(agg_result)
```

**Output**:
```
                 mean    sum    max
Department                          
Finance     62333.333333  187000  65000
HR          51000.000000  102000  52000
```

Here, we calculated the **mean**, **sum**, and **maximum** salary for each department.

### Common Aggregation Functions

- **`.apply()`**: Applies a custom function.
- **`.agg()`**: Applies one or multiple aggregations.
- **`.describe()`**: Gives a summary of descriptive statistics (count, mean, min, max, etc.).

In [1]:
import pandas as pd

df=pd.read_csv(r"C:\Users\user\OneDrive\Desktop\New Dataset Ducat\data.csv") 
df

      Fname     Lname  Age          City Occupation  Salary
0    Sophia       Lee   22      New York      Pilot   76121
1     James    Taylor   58      Columbus     Doctor   30977
2      Jack    Garcia   56        Dallas  Scientist   39683
3     Isaac    Martin   30        Austin  Architect   75545
4      Noah    Taylor   30      New York  Architect   60659
..      ...       ...  ...           ...        ...     ...
105   Grace    Miller   50       Seattle     Doctor   40175
106  Hannah  Anderson   34  Philadelphia      Pilot   61504
107   Frank     Brown   47  Philadelphia    Teacher   98922
108   Lucas       Lee   27   Los Angeles     Artist   95970
109  Oliver   Johnson   38  Indianapolis  Scientist   76965

[110 rows x 6 columns]

In [2]:
df["Age_Group"]=df['Age'].apply(lambda x: "Group(20-30)" if x in range(20,31) else
                                "Group(31-40)" if x in range(31,41) else
                                "Group(41-50)" if x in range(41,51) else
                                "Group(51-60)" if x in range(51,61) else
                                "Other"
                               )

In [3]:
df

      Fname     Lname  Age          City Occupation  Salary     Age_Group
0    Sophia       Lee   22      New York      Pilot   76121  Group(20-30)
1     James    Taylor   58      Columbus     Doctor   30977  Group(51-60)
2      Jack    Garcia   56        Dallas  Scientist   39683  Group(51-60)
3     Isaac    Martin   30        Austin  Architect   75545  Group(20-30)
4      Noah    Taylor   30      New York  Architect   60659  Group(20-30)
..      ...       ...  ...           ...        ...     ...           ...
105   Grace    Miller   50       Seattle     Doctor   40175  Group(41-50)
106  Hannah  Anderson   34  Philadelphia      Pilot   61504  Group(31-40)
107   Frank     Brown   47  Philadelphia    Teacher   98922  Group(41-50)
108   Lucas       Lee   27   Los Angeles     Artist   95970  Group(20-30)
109  Oliver   Johnson   38  Indianapolis  Scientist   76965  Group(31-40)

[110 rows x 7 columns]

### 1. What is the average salary for each occupation?

In [10]:
df.groupby('Occupation')['Salary'].mean().reset_index().round(2)

   Occupation    Salary
0  Accountant  48208.50
1   Architect  62824.81
2      Artist  73524.29
3      Doctor  55929.00
4    Engineer  64173.07
5  Journalist  50886.25
6      Lawyer  69686.93
7       Pilot  73311.27
8   Scientist  68697.67
9     Teacher  63917.88

### 2. How many people are in each occupation?

In [6]:
df.groupby('Occupation')['Occupation'].count().sort_values()

Occupation
Journalist     4
Accountant     6
Artist         7
Teacher        8
Pilot         11
Doctor        12
Lawyer        14
Engineer      14
Architect     16
Scientist     18
Name: Occupation, dtype: int64

### 3. What is the average age for each occupation?

In [9]:
df.groupby('Occupation')['Age'].mean().round()

Occupation
Accountant    51.0
Architect     39.0
Artist        42.0
Doctor        45.0
Engineer      42.0
Journalist    39.0
Lawyer        38.0
Pilot         37.0
Scientist     43.0
Teacher       42.0
Name: Age, dtype: float64

### 4. What is the total salary for each occupation?

In [10]:
df.groupby('Occupation')['Salary'].sum().reset_index()

   Occupation   Salary
0  Accountant   289251
1   Architect  1005197
2      Artist   514670
3      Doctor   671148
4    Engineer   898423
5  Journalist   203545
6      Lawyer   975617
7       Pilot   806424
8   Scientist  1236558
9     Teacher   511343

### 5. What is the maximum salary for each occupation?

In [2]:
df.groupby('Occupation')['Salary'].max().reset_index()

   Occupation  Salary
0  Accountant   81429
1   Architect   88413
2      Artist   96749
3      Doctor   99727
4    Engineer   97152
5  Journalist   63499
6      Lawyer   97182
7       Pilot   99057
8   Scientist   95844
9     Teacher   98922

### 6. What is the minimum salary for each occupation?

In [12]:
df.groupby('Occupation')['Salary'].min().reset_index()

   Occupation  Salary
0  Accountant   30695
1   Architect   38532
2      Artist   32816
3      Doctor   30977
4    Engineer   39138
5  Journalist   38469
6      Lawyer   39575
7       Pilot   33813
8   Scientist   38910
9     Teacher   36944

### 7. What is the count of people in each city?

In [14]:
df.groupby('City')['City'].count().sort_values()

City
San Jose         4
Columbus         5
San Diego        6
Indianapolis     6
Seattle          6
New York         7
Houston          7
Charlotte        8
Phoenix          8
San Antonio      8
Chicago          8
Dallas           9
Philadelphia     9
Los Angeles      9
Austin          10
Name: City, dtype: int64

### 8. What is the average salary for each city?

In [15]:
df.groupby('City')['Salary'].mean().round()

City
Austin          62700.0
Charlotte       63007.0
Chicago         63871.0
Columbus        60513.0
Dallas          61328.0
Houston         66851.0
Indianapolis    68432.0
Los Angeles     68082.0
New York        62701.0
Philadelphia    80326.0
Phoenix         59439.0
San Antonio     62992.0
San Diego       46086.0
San Jose        67324.0
Seattle         72874.0
Name: Salary, dtype: float64

### 9. What is the average age for each city?

In [16]:
df.groupby('City')['Age'].mean().round()

City
Austin          40.0
Charlotte       42.0
Chicago         41.0
Columbus        43.0
Dallas          46.0
Houston         36.0
Indianapolis    47.0
Los Angeles     41.0
New York        35.0
Philadelphia    43.0
Phoenix         44.0
San Antonio     37.0
San Diego       50.0
San Jose        42.0
Seattle         38.0
Name: Age, dtype: float64

### 10. What is the total salary for each city?

In [17]:
df.groupby('City')['Salary'].sum().reset_index()

            City  Salary
0         Austin  626998
1      Charlotte  504056
2        Chicago  510969
3       Columbus  302563
4         Dallas  551949
5        Houston  467958
6   Indianapolis  410591
7    Los Angeles  612741
8       New York  438910
9   Philadelphia  722931
10       Phoenix  475515
11   San Antonio  503934
12     San Diego  276519
13      San Jose  269295
14       Seattle  437247

### 11. What is the count of people for each age group?

In [28]:
group1=df["Age"][df['Age'].between(20,30)]
group2=df["Age"][df['Age'].between(31,40)]
group3=df["Age"][df['Age'].between(41,50)]
group4=df["Age"][df['Age'].between(51,60)]

print("Age Group(20-30) :",group1.size)
print("Age Group(31-40) :",group2.size)
print("Age Group(41-50) :",group3.size)
print("Age Group(51-60) :",group4.size)

Age Group(20-30) : 31
Age Group(31-40) : 20
Age Group(41-50) : 25
Age Group(51-60) : 34

In [18]:
# multiple Aggrigation
df.groupby("Occupation")["Salary"].agg(['count','min','max','mean','sum'])

            count    min    max          mean      sum
Occupation
Accountant      6  30695  81429  48208.500000   289251
Architect      16  38532  88413  62824.812500  1005197
Artist          7  32816  96749  73524.285714   514670
Doctor         12  30977  99727  55929.000000   671148
Engineer       14  39138  97152  64173.071429   898423
Journalist      4  38469  63499  50886.250000   203545
Lawyer         14  39575  97182  69686.928571   975617
Pilot          11  33813  99057  73311.272727   806424
Scientist      18  38910  95844  68697.666667  1236558
Teacher         8  36944  98922  63917.875000   511343

In [19]:
df.groupby("Occupation")[["Salary","Age"]].agg(['min','max','mean'])

           Salary                      Age
              min    max          mean min max       mean
Occupation
Accountant  30695  81429  48208.500000  40  58  50.666667
Architect   38532  88413  62824.812500  26  57  39.125000
Artist      32816  96749  73524.285714  26  59  42.142857
Doctor      30977  99727  55929.000000  24  58  44.666667
Engineer    39138  97152  64173.071429  25  56  42.500000
Journalist  38469  63499  50886.250000  23  59  39.000000
Lawyer      39575  97182  69686.928571  22  59  38.357143
Pilot       33813  99057  73311.272727  22  52  36.636364
Scientist   38910  95844  68697.666667  24  56  42.833333
Teacher     36944  98922  63917.875000  27  58  42.500000

In [34]:
df.groupby(["Occupation","City"])[["Salary","Age"]].agg(['min','max','mean'])

                        Salary                 Age
                           min    max     mean min max  mean
Occupation City
Accountant Charlotte     45547  45547  45547.0  40  40  40.0
           Chicago       39087  39087  39087.0  58  58  58.0
           Dallas        60977  60977  60977.0  58  58  58.0
           Indianapolis  31516  31516  31516.0  52  52  52.0
           Los Angeles   81429  81429  81429.0  52  52  52.0
...                        ...    ...      ...  ..  ..   ...
Teacher    Dallas        44969  44969  44969.0  27  27  27.0
           Houston       70288  70288  70288.0  30  30  30.0
           Philadelphia  98922  98922  98922.0  47  47  47.0
           San Antonio   36944  36944  36944.0  45  45  45.0
           San Jose      79157  79157  79157.0  55  55  55.0

[83 rows x 6 columns]

### 12. What is the maximum salary for each city?

In [21]:
df.groupby('City')['Salary'].max().reset_index()

            City  Salary
0         Austin   83172
1      Charlotte   94314
2        Chicago   94500
3       Columbus   88413
4         Dallas   94935
5        Houston   96749
6   Indianapolis   97152
7    Los Angeles   95970
8       New York   76291
9   Philadelphia   98922
10       Phoenix   99057
11   San Antonio   92603
12     San Diego   67482
13      San Jose   79157
14       Seattle   99727

### 13. What is the minimum salary for each city?

In [22]:
df.groupby('City')['Salary'].min().reset_index()

            City  Salary
0         Austin   48063
1      Charlotte   32816
2        Chicago   39087
3       Columbus   30977
4         Dallas   39683
5        Houston   39575
6   Indianapolis   31516
7    Los Angeles   43841
8       New York   41725
9   Philadelphia   42407
10       Phoenix   38469
11   San Antonio   31405
12     San Diego   30695
13      San Jose   49409
14       Seattle   40175

### 14. What is the count of people with each last name?

In [5]:
df.groupby('Lname')['Lname'].count().sort_values()

Lname
Davis         2
Thomas        2
Williams      3
Gonzalez      3
Smith         4
Jones         4
Jackson       4
Martin        5
Lopez         5
Martinez      6
Moore         6
Garcia        6
Johnson       6
Wilson        6
Hernandez     7
Brown         7
Anderson      7
Taylor        8
Miller        9
Lee          10
Name: Lname, dtype: int64

### 15. What is the average salary for each last name?

In [8]:
df.groupby('Lname')['Salary'].mean().round(2)

Lname
Anderson     62981.71
Brown        62089.43
Davis        67502.50
Garcia       43267.33
Gonzalez     61641.67
Hernandez    69038.43
Jackson      77951.00
Johnson      56621.67
Jones        83805.50
Lee          69530.30
Lopez        58941.40
Martin       64965.00
Martinez     68666.50
Miller       66505.22
Moore        71890.50
Smith        62119.75
Taylor       61141.12
Thomas       63170.00
Williams     66645.33
Wilson       61085.17
Name: Salary, dtype: float64

### 16. What is the count of people for each age group?

In [11]:
group1=df["Age"][df['Age'].between(20,30)]
group2=df["Age"][df['Age'].between(31,40)]
group3=df["Age"][df['Age'].between(41,50)]
group4=df["Age"][df['Age'].between(51,60)]

print("Age Group(20-30) :",group1.size)
print("Age Group(31-40) :",group2.size)
print("Age Group(41-50) :",group3.size)
print("Age Group(51-60) :",group4.size)

Age Group(20-30) : 31
Age Group(31-40) : 20
Age Group(41-50) : 25
Age Group(51-60) : 34

### 17. What is the maximum salary for each Occupation?

In [26]:
df.groupby('Occupation')['Salary'].max().reset_index()

   Occupation  Salary
0  Accountant   81429
1   Architect   88413
2      Artist   96749
3      Doctor   99727
4    Engineer   97152
5  Journalist   63499
6      Lawyer   97182
7       Pilot   99057
8   Scientist   95844
9     Teacher   98922

### 18. What is the count of people with each last name?

In [9]:
df.groupby('Lname')['Lname'].count().sort_values()

Lname
Davis         2
Thomas        2
Williams      3
Gonzalez      3
Smith         4
Jones         4
Jackson       4
Martin        5
Lopez         5
Martinez      6
Moore         6
Garcia        6
Johnson       6
Wilson        6
Hernandez     7
Brown         7
Anderson      7
Taylor        8
Miller        9
Lee          10
Name: Lname, dtype: int64

### 19. **Which occupation has the highest total salary?**

In [27]:
df.groupby("Occupation")['Salary'].max().sort_values().tail(1)

Occupation
Doctor    99727
Name: Salary, dtype: int64

### 20. **Which city has the highest average salary?**
    - Group by `City`, calculate the mean of `Salary`, then find the highest.

In [31]:
df.groupby("Occupation")['Salary'].mean().sort_values().tail(1)

Occupation
Artist    73524.285714
Name: Salary, dtype: float64

### 21. **What is the distribution of occupations across cities?**
    - Group by `City` and `Occupation`, use `.size()` to count.

In [32]:
df.groupby(["City", "Occupation"]).size()

City      Occupation
Austin    Architect     2
          Artist        1
          Doctor        1
          Journalist    1
          Lawyer        2
                       ..
San Jose  Teacher       1
Seattle   Doctor        2
          Engineer      1
          Lawyer        2
          Scientist     1
Length: 83, dtype: int64

### 22. **What is the average salary of people aged 30 and above in each occupation?**
    - Filter by `Age >= 30`, group by `Occupation`, calculate the mean of `Salary`.

In [34]:
df[df["Age"] >= 30].groupby("Occupation")["Salary"].mean().round()

Occupation
Accountant    48208.0
Architect     67641.0
Artist        64390.0
Doctor        51947.0
Engineer      64745.0
Journalist    50984.0
Lawyer        70285.0
Pilot         70778.0
Scientist     69374.0
Teacher       66625.0
Name: Salary, dtype: float64

### 23. **Which age group has the highest salary in each occupation?**
    - Group by `Occupation` and `Age`, find the maximum salary.

In [27]:
group1=df[df['Age'].between(20,30)]
group2=df[df['Age'].between(31,40)]
group3=df[df['Age'].between(41,50)]
group4=df[df['Age'].between(51,60)]
for i in [group1,group2,group3,group4]:
    print(i.groupby(['Occupation','Age'])['Salary'].max().sort_values(ascending=False).head(1))

Occupation  Age
Doctor      24     99727
Name: Salary, dtype: int64
Occupation  Age
Scientist   39     95844
Name: Salary, dtype: int64
Occupation  Age
Pilot       48     99057
Name: Salary, dtype: int64
Occupation  Age
Lawyer      59     97182
Name: Salary, dtype: int64

In [29]:
df.groupby(['Occupation','Age'])['Salary'].max().sort_values(ascending=False).head(1)

Occupation  Age
Doctor      24     99727
Name: Salary, dtype: int64

### 24. **What is the distribution of salaries in each occupation?**
    - Group by `Occupation`, use `.describe()` to get a summary (mean, median, etc.).

In [11]:
df.groupby('Occupation')['Salary'].describe()

,count,mean,std,min,25%,50%,75%,max
Occupation,,,,,,,,
Accountant,6.0,48208.500000,19709.306408,30695.0,33408.75,42317.0,57119.50,81429.0
Architect,16.0,62824.812500,16561.191234,38532.0,47010.25,61365.5,76027.50,88413.0
Artist,7.0,73524.285714,27488.817992,32816.0,51023.50,92603.0,95227.50,96749.0
Doctor,12.0,55929.000000,21794.789965,30977.0,37982.50,56580.0,68564.25,99727.0
Engineer,14.0,64173.071429,15856.486940,39138.0,52494.25,64914.5,67904.00,97152.0
Journalist,4.0,50886.250000,10231.148758,38469.0,47252.25,50788.5,54422.50,63499.0
Lawyer,14.0,69686.928571,20545.939368,39575.0,54305.00,64457.5,89876.75,97182.0
Pilot,11.0,73311.272727,18415.107461,33813.0,68143.50,76291.0,83012.50,99057.0
Scientist,18.0,68697.666667,17090.110715,38910.0,60558.50,69600.0,79363.25,95844.0
Teacher,8.0,63917.875000,20299.695975,36944.0,51140.00,62303.5,74949.50,98922.0

### 25. **What is the age distribution in each city?**
    - Group by `City`, calculate the mean and standard deviation of `Age`.

In [12]:
df.groupby('City')['Age'].describe()

              count       mean        std   min    25%   50%    75%   max
City
Austin         10.0  40.100000  13.576532  22.0  30.75  38.0  50.50  59.0
Charlotte       8.0  42.250000   9.377024  24.0  39.00  42.5  49.50  53.0
Chicago         8.0  40.750000  12.612352  25.0  32.75  38.0  53.00  58.0
Columbus        5.0  43.400000  13.390295  27.0  35.00  41.0  56.00  58.0
Dallas          9.0  45.777778  12.163242  25.0  41.00  51.0  52.00  58.0
Houston         7.0  35.571429  13.010984  26.0  28.00  28.0  41.50  56.0
Indianapolis    6.0  46.833333  11.651895  28.0  40.75  50.5  54.25  59.0
Los Angeles     9.0  41.000000  10.380270  27.0  36.00  39.0  50.00  57.0
New York        7.0  34.714286  12.711075  22.0  27.00  30.0  40.50  56.0
Philadelphia    9.0  42.777778   8.105211  34.0  34.00  43.0  47.00  54.0
Phoenix         8.0  43.750000  12.139075  25.0  36.75  44.5  54.00  59.0
San Antonio     8.0  36.750000   9.145647  26.0  28.50  37.5  42.00  51.0
San Diego       6.0  50.333333   5.125102  44.0  47.00  50.0  53.00  58.0
San Jose        4.0  41.500000  15.066519  27.0  29.25  42.0  54.25  55.0
Seattle         6.0  38.333333  14.787382  24.0  25.25  36.5  48.50  59.0

### 26. **What is the total salary of people aged below 40 in each occupation?**
    - Filter by `Age < 40`, group by `Occupation`, calculate the sum of `Salary`.

In [21]:
df[df["Age"] <= 40].groupby("Occupation")["Salary"].sum()

Occupation
Accountant     45547
Architect     556648
Artist        285322
Doctor        234445
Engineer      379899
Journalist    101577
Lawyer        586923
Pilot         536159
Scientist     634171
Teacher       168454
Name: Salary, dtype: int64

### 27. **Which city has the youngest average population?**
    - Group by `City`, calculate the mean of `Age`, and find the minimum.

In [36]:
group1.groupby("City")['Age'].min()

City
Austin          22
Charlotte       24
Chicago         25
Columbus        27
Dallas          25
Houston         26
Indianapolis    28
Los Angeles     27
New York        22
Phoenix         25
San Antonio     26
San Jose        27
Seattle         24
Name: Age, dtype: int64

### 28. **Which occupation has the oldest average age?**
    - Group by `Occupation`, calculate the mean of `Age`, and find the maximum.

In [19]:
df.groupby("Occupation")['Age'].mean().max().round()

np.float64(51.0)

### 29. **What is the total number of people in each city-occupation combination?**
    - Group by `City` and `Occupation`, count occurrences.

In [ ]:
df.groupby('Lname')['Lname'].count().sort_values()

### 30. **What is the average salary in each occupation, sorted by salary?**
    - Group by `Occupation`, calculate the mean of `Salary`, and sort the result.

In [18]:
df.groupby('Occupation')['Salary'].mean().round(2).sort_values()

Occupation
Accountant    48208.50
Journalist    50886.25
Doctor        55929.00
Architect     62824.81
Teacher       63917.88
Engineer      64173.07
Scientist     68697.67
Lawyer        69686.93
Pilot         73311.27
Artist        73524.29
Name: Salary, dtype: float64

### 31. **Which occupation has the highest salary variance?**
    - Group by `Occupation`, calculate the variance of `Salary`.

In [19]:
df.groupby('Occupation')['Salary'].mean().round(2).sort_values()

Occupation
Accountant    48208.50
Journalist    50886.25
Doctor        55929.00
Architect     62824.81
Teacher       63917.88
Engineer      64173.07
Scientist     68697.67
Lawyer        69686.93
Pilot         73311.27
Artist        73524.29
Name: Salary, dtype: float64

### 32. **Which city has the most diverse set of occupations?**
    - Group by `City`, use `.nunique()` on `Occupation`.

### 33. **What is the median salary in each city?**
    - Group by `City`, calculate the median of `Salary`.

In [20]:
df.groupby('Occupation')['Salary'].median()

Occupation
Accountant    42317.0
Architect     61365.5
Artist        92603.0
Doctor        56580.0
Engineer      64914.5
Journalist    50788.5
Lawyer        64457.5
Pilot         76291.0
Scientist     69600.0
Teacher       62303.5
Name: Salary, dtype: float64

### 34. **What is the average salary for people named 'Sophia'?**
    - Filter by `Fname == 'Sophia'`, calculate the mean of `Salary`.

In [9]:
df[df["Fname"] == 'Sophia'].groupby("Fname")["Salary"].mean()

Fname
Sophia    80903.6
Name: Salary, dtype: float64

### 35. **What is the proportion of people in each occupation in the dataset?**
    - Group by `Occupation`, count occurrences, and normalize to get proportions.

In [21]:
df.groupby('Occupation')['Occupation'].count().sort_values()

Occupation
Journalist     4
Accountant     6
Artist         7
Teacher        8
Pilot         11
Doctor        12
Lawyer        14
Engineer      14
Architect     16
Scientist     18
Name: Occupation, dtype: int64

### 36. **What is the highest salary for each combination of city and occupation?**
    - Group by `City` and `Occupation`, calculate the maximum of `Salary`.

In [22]:
df.groupby(['City','Occupation'])['Salary'].max()

City      Occupation
Austin    Architect     75545
          Artist        48063
          Doctor        71811
          Journalist    50180
          Lawyer        54054
                        ...
San Jose  Teacher       79157
Seattle   Doctor        99727
          Engineer      51851
          Lawyer        97182
          Scientist     61562
Name: Salary, Length: 83, dtype: int64

### 37. **How many people aged over 50 work in each city?**
    - Filter by `Age > 50`, group by `City`, count occurrences.

In [6]:
df[df["Age"] >= 50].groupby("City")["City"].count()

City
Austin          3
Charlotte       2
Chicago         3
Columbus        2
Dallas          6
Houston         2
Indianapolis    3
Los Angeles     3
New York        1
Philadelphia    2
Phoenix         3
San Antonio     1
San Diego       4
San Jose        2
Seattle         2
Name: City, dtype: int64

### 38. **Which age group earns the most in each city?**
    - Group by `City` and `Age`, calculate the mean of `Salary`.

In [25]:
df.groupby(['City','Age_Group'])['Salary'].mean().round()

City          Age_Group
Austin        Group(20-30)    58019.0
              Group(31-40)    69679.0
              Group(41-50)    73998.0
              Group(51-60)    56635.0
Charlotte     Group(20-30)    94314.0
              Group(31-40)    62458.0
              Group(41-50)    72733.0
              Group(51-60)    33314.0
Chicago       Group(20-30)    58205.0
              Group(31-40)    70626.0
              Group(51-60)    60894.0
Columbus      Group(20-30)    62072.0
              Group(31-40)    88413.0
              Group(41-50)    73547.0
              Group(51-60)    39266.0
Dallas        Group(20-30)    69952.0
              Group(41-50)    74098.0
              Group(51-60)    52770.0
Houston       Group(20-30)    66745.0
              Group(51-60)    67117.0
Indianapolis  Group(20-30)    97152.0
              Group(31-40)    76965.0
              Group(41-50)    63499.0
              Group(51-60)    57658.0
Los Angeles   Group(20-30)    71675.0
              Group(31-40)    56595.0
              Group(41-50)    65688.0
              Group(51-60)    84114.0
New York      Group(20-30)    59036.0
              Group(31-40)    76291.0
              Group(41-50)    59259.0
              Group(51-60)    67217.0
Philadelphia  Group(31-40)    79986.0
              Group(41-50)    73117.0
              Group(51-60)    91818.0
Phoenix       Group(20-30)    51022.0
              Group(31-40)    85438.0
              Group(41-50)    72479.0
              Group(51-60)    47691.0
San Antonio   Group(20-30)    73612.0
              Group(31-40)    92603.0
              Group(41-50)    53030.0
              Group(51-60)    31405.0
San Diego     Group(41-50)    51644.0
              Group(51-60)    34972.0
San Jose      Group(20-30)    70364.0
              Group(51-60)    64283.0
Seattle       Group(20-30)    71047.0
              Group(41-50)    63462.0
              Group(51-60)    97182.0
Name: Salary, dtype: float64

### 39. **What is the salary range (max - min) in each occupation?**
    - Group by `Occupation`, calculate the salary range (`max - min`).

In [3]:
df.groupby("Occupation")["Salary"].agg(lambda x:x.max()-x.min())

Occupation
Accountant    50734
Architect     49881
Artist        63933
Doctor        68750
Engineer      58014
Journalist    25030
Lawyer        57607
Pilot         65244
Scientist     56934
Teacher       61978
Name: Salary, dtype: int64